Revit 2027 API
BuiltInFailures.WallFailures.UnableToCreateWallForPanel Property
 Unable to create wall for curtain wall panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToCreateWallForPanel { get; }
Public Shared ReadOnly Property UnableToCreateWallForPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToCreateWallForPanel {
	FailureDefinitionId^ get ();
}
static member UnableToCreateWallForPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace